In [3]:
import pandas as pd
import numpy as np

## Creating Data Frame

In [9]:
data = {
    'name ' : ["hari","krishna","akhil","kumar"],
    "age " : [18,19,20,21],
    "year" : [2002 ,2001 ,2000 ,1999]
}

In [10]:
data

{'name ': ['hari', 'krishna', 'akhil', 'kumar'],
 'age ': [18, 19, 20, 21],
 'year': [2002, 2001, 2000, 1999]}

In [17]:
df1 = pd.DataFrame(data)           # must write " DataFrame " like this only , don't write " dataframe "
df1

     name   age   year
0     hari    18  2002
1  krishna    19  2001
2    akhil    20  2000
3    kumar    21  1999

## Setting Index

In [20]:
df2 = pd.DataFrame(data , index = ["1" ,'2' , '3' ,'4'])
df2

     name   age   year
1     hari    18  2002
2  krishna    19  2001
3    akhil    20  2000
4    kumar    21  1999

## Extracting Info

In [51]:
df2.loc["2"]     # use only the Square Brackets

name     krishna
age           19
year        2001
Name: 2, dtype: object

In [35]:
df2.iloc[2:6]

   name   age   year
3  akhil    20  2000
4  kumar    21  1999

In [47]:
df2.iloc[1:3 , 1:2]         # 1:3 = row   And  1:2 = column

   age
2    19
3    20

In [49]:
df2.iloc[:4 , -2:-1]

   age
1    18
2    19
3    20
4    21

In [40]:
df2.iloc[: , -1]

1    2002
2    2001
3    2000
4    1999
Name: year, dtype: int64